<template>
  <div class="h-screen bg-blue-900 relative flex justify-center">
    <img
      src="@/assets/images/backgrounds/10.jpg"
      class="absolute object-cover w-full h-full object-left-bottom"
      alt=""
    />
    <!-- <video
      loop
      autoplay
      src="@/assets/videos/10.webm"
      class="absolute object-cover w-full h-full"
      alt=""
    /> -->
    <BgVideo
      :src="require('@/assets/videos/test/10.webm')"
      class="object-left-bottom"
      :end="0.8"
    />

    <div class="relative mt-12 ml-56">
      <Header class="mb-12">
        <template v-slot:name>Олеся</template>
        со-основательница ЛГБТ бара в Бишкеке, 29 лет
      </Header>
      <Story :storyText="storyText" />
    </div>
  </div>
</template>

<script>
import Header from '@/components/Header.vue'
import Story from '@/components/Story.vue'
export default {
  components: { Header, Story },
  data() {
    return {
      storyText: `- Мы открыли заведение «Аутрич» и проработали три месяца в этом районе. За это время пережили просто невероятное количество насилия, драк среди своих же, внутри сообщества. У нас во время открытия было 11 драк, одна пробитая голова и одна сломанная нога. Это травмировало нас. 

Через три месяца мы закрылись, после того, как на нас напали - 30 мужчин, вооруженных камнями и ножами. Нам удалось закрыть дверь с обратной стороны, потому что внутри находились люди. 

За шесть лет мы переезжали пять раз. Сейчас мы на новом месте, надеюсь, все будет хорошо.

Я цис-женщина, сексуальная ориентация – пансексуалка. Это то, что мне ближе всего, но вообще я прихожу к тому, что начинаю отказываться от сексуальной ориентации вовсе. Для меня прежде всего важен человек, вне зависимости от гендера и сексуальной ориентации. Для меня сексуальная ориентация - очень плавучая вещь, она может часто меняться.

- У вас есть ребенок, расскажите про этот опыт в однополой семье?

- Мы не планировали с партнеркой совместного ребенка, все получилось достаточно быстро. Я сразу сказала ей, что хочу родить. И получилось так, что я забеременела естественным путем – после секса с гетеросексуальным цис-мужчиной.

В целях безопасности ребенка она никогда не называла мою партнершу мамой. Просто она знает, что она для нее близкий человек. Конечно, были вопросы: «Почему вы спите вместе?», «А где мой папа?». Я понимаю, что не время сейчас ей что-то знать, потому что она может кому-то рассказать и для нее это небезопасно. 

Я знаю, что дети могут быть жестокими и агрессивными, и не хочу менять кучу садиков или столкнуться еще с какими-то проблемами, которые могут быть – вплоть до того, что с садика позвонят в Соцзащиту и меня начнут вызывать. 

Когда ты растишь ребенка, это сложный этап. Чем они старше, тем больше они видят, тем больше замечают. Тем больше начинают что-то знать. Я думаю, что когда она подрастет, и когда я пойму, что это безопасно, то мы сможем поговорить с ней об этом. Я расскажу ей о разнообразии и что разнообразие может быть не только в ЛГБТ-сообществе, но также и в гетеро. И что есть гетеросексуальные семьи, где есть, как принято говорить в обществе, муж и жена. Что отношения бывают разные. Но это, когда она станет старше.`,
    }
  },
}
</script>

