<template>
  <div class="h-screen bg-blue-900 relative flex justify-center">
    <img
      src="@/assets/images/backgrounds/12.png"
      class="absolute object-cover w-full h-full"
      alt=""
    />
    <video
      loop
      autoplay
      src="@/assets/videos/12.webm"
      class="absolute object-cover w-full h-full"
      alt=""
    />
    <div class="relative mt-12 mr-64 pr-56">
      <Header class="mb-12">
        <template v-slot:name
          >ЛГБТ-активист с юга <br />
          Кыргызстана</template
        >
      </Header>
      <Story :storyText="storyText" />
    </div>
    <div class="absolute z-30 bottom-0 left-1/2 mb-20 ml-8 text-white">
      <div class="group relative mb-10 flex flex-col">
        <div
          class="absolute bottom-0 modal overflow-y-scroll py-5 px-3 mb-10 hidden group-hover:block bg-white text-xs leading-loose text-primary-dark whitespace-pre-line"
          v-html="modalText1"
        ></div>

        <p
          class="group-hover:bg-secondary cursor-pointer w-auto rounded-full py-1 px-3"
        >
          О чем статья о мужеложестве?
        </p>
      </div>
      <div class="relative focus flex flex-col">
        <div
          class="absolute bottom-0 modal overflow-y-scroll py-5 px-3 mb-10 bg-white text-sm leading-loose text-primary-dark whitespace-pre-line"
          v-html="modalText2"
          :class="[mt1 ? 'block' : 'hidden']"
        ></div>

        <p
          @click="mt1 = !mt1"
          class="hover:bg-secondary cursor-pointer w-auto rounded-full py-1 px-3"
        >
          Что случилось на марше 8 марта 2019?
        </p>
      </div>
    </div>
  </div>
</template>

<script>
import Header from '@/components/Header.vue'
import Story from '@/components/Story.vue'
export default {
  components: { Header, Story },

  methods: {
    hide() {
      this.mt1 = !this.mt1
    },
  },
  data() {
    return {
      mt1: false,
      mt2: false,

      modalText2: `8 марта 2019 года в центре Бишкека проходил мирный марш солидарности за права женщин. В акции участвовало около 400 человек. Многих возмутило, что в марше участвовали ЛГБТ-люди с радужной символикой и лозунгами. На что правозащитники ЛГБТ-сообщества пояснили, что права женщин напрямую связаны с правами лесбиянок, бисексуалок и транс-женщин. Движение «Кыргыз Чоролору» (более известное как «Кырк Чоро») тогда потребовало отставки мэра, а также обратилось в Генпрокуратуру за тем, чтобы участников марша привлекли к ответственности.`,
      modalText1: `В Уголовном Кодексе СССР от 1933 года была статья «О мужеложестве», которая, впоследствии распространилась на другие советские республики. На данный момент такая статья есть в Уголовных Кодексах Республики Узбекистан (120 статья) и Республики Таджикистан (139 - 141 статья).

С 1 января 2019 года в Уголовном кодексе Кыргызстана действуют две статьи, связанные с мужеложеством: 162 («Насильственные действия сексуального характера») и 163 («Понуждение к действиям сексуального характера»). `,
      storyText: `- За последние два года в Кыргызстане увеличилось количество незаконных задержаний ЛГБТ-людей со стороны правоохранительных органов. Они сидят на сайтах, знакомятся, а когда приходишь на встречу, то оказывается, что этот человек - представитель правоохранительных органов. Тебя задерживают, везут в участок, избивают, вымогают деньги. 

В советское время пугали 320-й статей за мужеложество*. Позже начали ставить на учет всех представителей ЛГБТ-сообщества и шантажировать - звонить женам, родителям. На юге Кыргызстана 90 % представителей сообщества - женатые люди. Или же бывает так - задержали одного, если у него нет денег, то он должен найти троих из сообщества и его отпустят. Иногда, чтобы спасти свою шкуру, ребятам приходится давать контакты своих друзей. 

Раньше избивали сильно, когда задерживали, а после помощи нашего знакомого адвоката, не избивают. Блин, вот я этому рад. Это тоже достижение в какой-то степени. Потому что обычно берут деньги, избивают до полусмерти, пакеты на голову надевают, иголки в пальцы засовывают. А тут они перестали бить.

Ещё вот, например, после прошлогоднего марша* у нас тоже массовое задержание было. Провели марш в Бишкеке, а по башке получили мы, понимаете. Это все как бы профилактика правоохранительных органов. Они нас хотят держать в какой-то узде, чтобы мы не высовывались.

ЛГБТ-сообщество очень закрытое. Это связано с религией в первую очередь, потому что в основном все ребята мусульмане, у всех есть семьи. Например, мальчику 20 лет и если родители узнают, что он принадлежит к гей-сообществу, то его сразу женят, хочет он того или нет. При этом даже если семья не может себе позволить сыграть свадьбу, то они берут кредит полмиллиона, лишь бы поженить. Они думают, что это болезнь уйдет после того, как он женится. Ну, как бы попробует секс и все уйдет. У большинства, особенно сельских, такое мнение.

Не женаты только те люди, которые молодые (20-25 лет), или те, кто эмигрировал. 

Когда узнают про тебя, с тобой перестают здороваться друзья, с которыми ты учился раньше и дружил, соседи или же начинают тебя запугивать. Приходится даже менять место жительства. Это двойная жизнь - ходишь на работу одним человеком, возвращаешься с работы другим.

Сейчас молодое поколение немного проще. У ребят уже есть возможность уехать в Россию на заработки и не возвращаться. Есть ребята, которые уезжают на заработки, занимаются секс-работой, ставят искусственные импланты, работают пару лет, а затем возвращаются, снимают эти импланты и женятся. У многих жены счастливые, потому что ребята делают все для этого. Потому что эта женщина - стена между обществом и ими, она прикрывает его, защищает от всего. У людей есть стереотип, что геи не женятся, у них нет детей, а тут показывают – вот моя жена, вот дети.`,
    }
  },
}
</script>

