<template>
  <div class="h-screen relative flex justify-center">
    <img
      src="@/assets/images/backgrounds/13.png"
      class="absolute object-cover w-full h-full"
      alt=""
    />
    <video
      loop
      autoplay
      src="@/assets/videos/13.webm"
      class="absolute object-cover w-full h-full"
      alt=""
    />
    <div class="relative mt-12 mr-64 pr-56">
      <Header class="mb-12">
        <template v-slot:name
          >ЛГБТ-активист с юга <br />
          Кыргызстана</template
        >
      </Header>
      <Story :storyText="storyText" />
    </div>
  </div>
</template>

<script>
import Header from '@/components/Header.vue'
import Story from '@/components/Story.vue'
export default {
  components: { Header, Story },
  data() {
    return {
      storyText: `Про офис и безопасное пространство  

Я бы так сказал, если я живу 25 % времени с семьей, а 75 % - с инициативной группой, то несмотря на то, сколько лет я женат, я больше живу сообществом. Да, есть любовь к семье, но не такая как к сообществу.

Вот этот офис для меня лучше, чем мой родной дом. Конечно, я иногда убегаю. А иногда прихожу просто в офис и говорю: «Ребят, я сегодня останусь в офисе». Вот эти стены лечат, тут я себя более свободно чувствую, могу более открыто говорить о себе. Дома же я этого не сделаю, дома я любящий муж, отец, сыну памперсы меняю, мусор выкидываю. А тут другое. Тут я ни под кого не подстраиваюсь, живу так, как хочу. 

Мы почему в этом районе снимаем - это центр города. Тут нет постоянных жильцов, только квартиранты, которые периодически приезжают, переезжают, съезжают. Раньше мы снимали где подешевле, естественно, но месяца на полтора нас хватало обычно. 

Еще мы всегда выбираем такую территорию, чтобы всем национальностям было легко приходить в офис. Вот, например, если бы офис был в стороне аэропорта, то там не особо благополучный район и туда узбеки не суются, соответственно узбеки не стали бы туда ходить. Если бы мы сняли в Оше в районе 10 Адыр (городок «Туран»), то кыргызы бы перестали к нам ходить в офис. А тут центр, тут живут и кыргызы, и узбеки, и все другие национальности. 

У нас есть лидеры каждой группы ЛГБТ-сообщества. Это обычно состоятельные люди, которые снимают квартиру и проводят тусовки. Все лидеры на юге - это взрослые, состоятельные мужчины, которые могут себе позволить раз в неделю потратить определенную сумму на сообщество. Это и есть мафиози, один человек диктует, все остальные под них подстраиваются. Открытый человек не может быть лидером. Лидеры не влияют на нашу деятельность. Да, иногда бывает, запрещают как-то ходить.  

Меня часто критикуют за то, что из-за моей деятельности страдает сообщество и больше задерживают, показывают по телику, а если бы я не высовывался, то нас бы не трогали. Такая критика есть, она постоянная, от нее, мне кажется, не избавиться. Раньше меня это раздражало, теперь я спокойнее стал относиться к этому.

Про взаимоотношения внутри сообщества 

У нас на улице сообщество друг с другом не здоровается. Например, я с вами 2-5 раз встречался, я знаю ваше имя, вы – мое. Но я с вами не поздороваюсь - это не безопасно. Можно кивнуть, но и то это редко. Мало ли что. Может быть рядом со мной жена, дети или вообще милиция стоит и наблюдает за мной, с кем я здороваюсь. В целях безопасности у нас давно принято не здороваться, не приглашать к себе в гости и сообщество не обижается на это.`,
    }
  },
}
</script>

