<template>
  <div class="h-screen bg-blue-900 relative flex justify-end">
    <img
      src="@/assets/images/backgrounds/5.jpg"
      class="absolute object-cover w-full h-full object-bottom"
      alt=""
    />
    <!-- <video
      loop
      autoplay
      src="@/assets/videos/05.webm"
      class="absolute object-cover w-full h-full"
      alt=""
    /> -->
    <BgVideo
      :src="require('@/assets/videos/webm/5.webm')"
      class="object-bottom"
      :start="0.5"
      :end="0.8"
    />

    <div
      class="relative my-16 mr-64 pr-32 desktop:pr-0 laptop:mr-32 flex flex-col justify-between"
    >
      <Header>
        <template v-slot:name>Диас</template>
        транс-мужчина, активист, 24 года
      </Header>
      <Story :storyText="storyText" />
    </div>
  </div>
</template>

<script>
import BgVideo from '@/components/BgVideo.vue'

import Header from '@/components/Header.vue'
import Story from '@/components/Story.vue'

export default {
  components: { Header, Story, BgVideo },
  data() {
    return {
      storyText: ` Когда люди не понимали кто я, они сразу же смотрели на грудь. Они считывали меня как девушку - это то с чем я сталкивался и почему удалил грудь.    

В подростковом периоде, когда начинает расти грудь, транс-мужчины не хотят чтобы она росла, возникает ненависть к ней. Есть ненависть к гениталиям, но у всех транс-людей это по-разному. В моем случае - я не хочу делать операцию на гениталии, потому что это будет как что-то неживое. Я не хочу терять чувствительность там, лишаться того, от чего я получаю удовольствие.

Транс-человек не может скрывать свою идентичность. Ты делаешь переход и все отражается внешне. Ты никогда не спрячешься от своих родителей, ты вынужден делать каминг-аут. Чаще всего родители выгоняют, избивают, подстраивают корректирующие изнасилования, чтобы ребенок понял, что он не транс. 

Я ходил в зал со своим транс-другом. Наши мысли были о том, что на нас смотрят и сколько мы жмём, и что мы не дотягиваем до них. Ты не контролируешь эти мысли, они нападают на тебя. Ты на самом деле не сконцентрирован на упражнении, а думаешь о том, что думают они и палят ли они тебя, выдает ли тебя что-нибудь? Правильно ли ты сделал имитацию члена, настолько ли он большой или маленький и, вообще, в правильном ли месте он расположен? Мой друг часто ударялся о другие предметы, штанги, потому что очень много думал. 

Я не менял [паспорт] потому, что часто пользовался документами при перелетах. У этого есть несколько причин. Одна из них - когда транс-люди делают переход, получают желаемое тело и желаемые результаты, то как правило некоторые из них забывают прежний опыт, ощущения. Когда ты перестаешь с этим сталкиваться, ты начинаешь жить другой жизнью. Конечно, тебе намного легче и тебе круто, ты не хочешь чувствовать того, что было, но ты забываешь опыт и живешь цис-гетеронормативной жизнью. Так бывает. Я бы не хотел забывать то, с чем сталкиваются транс-люди, которые не сменили документы.  

Были люди которые спрашивали у меня: «У вас, наверное, гормональный сбой?» Это было как раз в тот момент, когда у меня было настроение «принимай женщин такими, какие они есть». Я ответил, что у меня нет гормонального сбоя. Она спросила: «Ты, наверное, пол поменял?» Для меня это было некорректно и я сказал: «Ничего я не менял. И разве в нашей стране это возможно?». Она спросила: «Почему ты так выглядишь?», я сказал: «Потому, что я так хочу». `,
    }
  },
}
</script>

