<template>
  <div class="h-screen bg-primary-darker relative flex justify-center">
    <div class="outro-container overflow-y-scroll pr-10 mt-20 mb-10 text-white">
      <p class="text-xl font-normal whitespace-pre-line" v-html="outroText"></p>
      <OutroTeam />
      <h1 class="text-4xl font-bold mt-10 mb-16">Участники проекта</h1>
      <p
        class="text-xl font-normal whitespace-pre-line mb-32"
        v-html="teamInfo"
      ></p>
    </div>
  </div>
</template>

<script>
import OutroTeam from '@/components/OutroTeam.vue'
export default {
  components: {
    OutroTeam,
  },
  data() {
    return {
      navbar: {
        prev: 'Page13',
        prevT: 'slide-right',
      },
      outroText: `Скорее всего, этого исследования не было бы, если бы в конце 2019 года художественный коллектив «Managua Furiosa» из Никарагуа не предложил бы реализовать проект о жизни ЛГБТ-людей «Share to Resist». Инициатива коллаборативная, но по концепции наша команда, состоящая из четырех человек (Талгат, Диана, Светлана из группы 705 и Майя), двигалась самостоятельно и независимо.

С самого начала работы каждому из нас были интересны свои линии в исследовании, потому что мы имели опыт в разных сферах: Талгат – в видео, Света – в фотографии, Диана – в текстах. 

Но из-за пандемии COVID-19 процесс все же получился более коллективным и независимо друг от друга мы работали лишь в нескольких местах, где были возможны фото- и видеосъемки. В том числе и потому, что зачастую ЛГБТ-сообщество закрыто для камер в целях безопасности. 

Особой методологии в работе не было. Для нас этот проект был прежде всего художественным процессом, и важно было сначала погрузится в контекст жизни ЛГБТ-людей в Кыргызстане, а лишь затем определяться с концепцией и фокусом материала. 

Итогом работы и размышлений команды проекта стал лонгрид, куда вошли цитаты из интервью более 20 героев (геи, лесбиянки, транс-люди, активисты), индивидуальных и коллективных встреч. В каких-то темах кто-то повторялся, были схожие проблемы, случаи и ситуации, но мы остановились на разных моментах их жизни. Поэтому все представленные истории не связаны только одной общей темой или фокусом. Наверное, в этом плане наш лонгрид и не является «классическим». Но мы и не стремились к этому...

Отобранные части интервью нам кажутся уникальными, передающими индивидуальность каждого, мир героя и его самобытность. Но несмотря на их различия, в материале все же присутствует атмосферная визуальная линия, объединяющая их всех, - это пространство. 

Места (офис, гей-клуб, дом, бар), где каждый из них порой уединяется, чувствует свой мир, может быть свободным и самим собой.
`,
      teamInfo: `Творческая группа 705: Талгат Бериков - (работа с видео), Светлана Зеленская - (фотодокументация), Диана Рахманова (интервьюирование, работа с текстом). 

Майя Абдылдаева (фиксерка, консультантка)

Татьяна Зеленская (анимация для лонгрида)

Алмаз Исаков (дизайн лонгрида)

Мирзаали Рузиматов (разработка и верстка лонгрида)

Выражаем благодарность всем героям проекта, а также художественному коллективу «Managua Furiosa», Майе Абдылдаевой, Диане Ухиной, Алмазу Исакову и ОсОО «Фриланс Кей Джи».
Финансовая поддержка проекта: Фонд Принца Клауса
`,
    }
  },
}
</script>

