<template>
  <div class="flex">
    <outro-modal
      class="w-1/4 h-56"
      v-for="(item, index) in team"
      :key="index"
      v-bind="item"
    >
    </outro-modal>
  </div>
</template>

<script>
import OutroModal from '@/components/OutroModal.vue'

export default {
  components: {
    OutroModal,
  },
  data() {
    return {
      team: [
        {
          name: 'Светлана',
          video: require('@/assets/videos/outro/sveta.mp4'),
          text: `Ситуация с ковидной изолированностью как будто подчеркнула изолированность человеческую. Мы все живем в информационном пузыре, создавая вокруг себя удобную и безопасную среду, тем самым усугубляя или создавая стереотипное, плоское представление о мире. Сейчас, когда изменение реальности происходит стремительнее, чем когда-либо, понятие дистанции растворяется в звонках онлайн-конференций. Расстояния, стены, разграничения по группам рушатся и многие неочевидные проблемы, новые стороны жизни открываются даже тем, кто этого не ищет.

В специальной литературе и других источниках я часто сталкивалась с тем, что ЛГБТ-люди представлены немного плоскими. В целях защиты их идеализируют, превращают в «хороших персонажей» из сказок с дуальным миром, где все делится на черное и белое. Я ставила себе задачу: постоянно держать эту мысль в голове. Ведь, чтобы убрать стену между людьми, важно очеловечить ЛГБТ - осветить объемным светом, вырвать картонного персонажа из плоскости сказки в реальный сложный мир. 

Однако ковидная реальность и онлайн-общение усложнили эту задачу, с одной стороны, а с другой — заставили посмотреть на ситуацию сквозь новую оптику. В череде онлайн-звонков и без возможности почувствовать живое общение мне было сложно и некомфортно воспринимать информацию на слух. Вся моя работа построена на формировании визуальных образов, а в новой реальности я стала как будто слушателем подкастов, хоть и с возможностью задавать вопросы. Но именно эти некомфортные условия помогли оценить собственные ощущения в новом ключе.

Условия пандемии наложили свой отпечаток и на те малочисленные безопасные места, в которых могут находиться ЛГБТ-люди. На время самоизоляции единственный в Бишкеке клуб остался без посетителей, его пустое пространство как будто вынуждает тебя фантазировать, представлять важность этого места для сообщества, думать о том, что там может происходить ночью, видеть призраки танцующих людей. 

Эта «призрачность» — подходящая метафора для того, как ЛГБТ воспринимают в обществе: они как бы есть и их как бы нет. Есть только наше представление о них, флер этой тусовки. Как и призраки, ЛГБТ-люди существуют полулегально. В стереотипных головах и мыслях они - скорее идея, а не реальные личности из плоти и крови с запахами и звуками.

В контексте «призрачности» клуб — это как раз то реальное место, где они заявляют о себе как материальные объекты, где их истории и образы, созданные в виртуальности, воплощаются в настоящее, живое.

Для ЛГБТ клуб — безопасное место, где они сталкиваются с реальностью, в том числе и с самими собой. Все их истории очень разные. Это индивидуальные миры людей, которые трудно уложить в одно пространство объективной реальности. В клубе они конфликтуют, дружат, знакомятся, там же и происходит столкновение всех этих реальностей, материализация и заявление себя в пространстве.

ЛГБТ-люди, находящиеся в постоянной тревоге и ищущие безопасные места, накладывают свои ожидания на клуб. Но он — это не какое-то объединенное мета-пространство, клуб — это и есть все они, полные, в том числе, негатива, раздражения и тревоги. Сталкиваясь, все это множится, возникают конфликты. То, что не находит выхода в повседневной реальности, проявляется в клубе. Как и зеркала на его стенах, клуб — это отражение всего того, что принесли туда посетители. 
`,
        },
        {
          name: 'Талгат',
          video: require('@/assets/videos/outro/talgat.mp4'),
          text: ` Со временем я начал понимать, что какие-то вещи в обществе порицаются, а какие-то считаются «правильными». Я начал видеть в этой системе изъяны. Это одна из призм, через которую люди смотрят на мир, и у нее есть свои недостатки. 

Организовывая кинофестиваль, создавая альтернативную площадку, строя свою личную жизнь, я всегда отталкиваюсь от своих ощущений, полагаюсь на свою интуицию. Я руководствуюсь тем, что правильно для меня, и часто это идет вразрез с тем, что люди привыкли видеть, слышать или рассуждать. 

Я не разделяю людей на «нас» и на «них» - мы все являемся частью чего-то целого. Но внутри этого целого мы порой вынуждены или хотим разделяться, создавая свои закрытые/открытые сообщества.

Способность к саморефлексии, способность ставить себя на место другого и сострадание могут повлиять на ситуацию не только с гомо-, транс- и другими фобиями, но и на остальные проблемы в мире. 

Мне кажется, важно понимать, что мы связаны не только с людьми в нашем доме, но и с людьми на улице и со всем миром. Все наши поступки, решения влияют на всех - на окружающую среду, на людей, на пространства, на энергетику и на ощущения.
`,
        },
        {
          name: 'Майя',
          video: require('@/assets/videos/outro/maya.mp4'),
          text: `За то время, что занимаюсь активизмом, я поняли, что эффективного способа говорения о жизнях людей, вызовах не существует. Когда мы говорим, что страдаем,нам в ответ говорят, что мы ноем. Когда говорим о счастье, нам говорят, не выпячивать его и сидеть дома. Когда молчим, нам говорят, что мы сами виноваты, что не говорим. Когда мы требуем уважения и соблюдения наших законных прав, нам в ответ говорят, что у нас нет прав. 

Мы, пока что, еще долго будем теми самыми маргиналами, которых нет. А если и есть, то это пропаганда, шайтан или дьявол. Чего ходить далеко, моя мама думает, что мне промыли мозги и мой труд эксплуатируют (касательно второго она права - капитализм многих эксплуатирует).

Мой вывод вовсе не значит, что надо перестать сопротивляться и заявлять о себе. Я написали его к тому, чтобы напомнить себе, поделиться, что в нас заложены социальные паттерны (гетеро, цис, патриархат, бинарность), которые сформировали модели и механизмы угнетения (дискриминацию, гомофобию, трансфобию, фемицид…), привилегии (например, быть представительницей* титульной нации, цисгендерной, гетеросексуальной персоной) и вседозволенность власти (ну, тут без комментариев). 

И да, мне легче смириться с мыслью, что эти паттерны постепенно будут исчезать, но на это потребуются века, тысячелетия и прочие исчисления. Не зря в народе говорят: чем раньше начнешь, тем раньше закончишь. У всех свои проблемы, для каждых их разрешение очень важно. Но есть четкое разделение между проблемами и социальным угнетением. Социальная иерархия создает социальное угнетение, потому что есть те, кто угнетает, а есть те, кого угнетают. 

Очень просто понять одну простую вещь - у нас есть социальное научение о том какими быть, кого любить, с кем трахаться. Мы не живем по разные стороны баррикад, более того, иногда вместе встаем на одну сторону против общего «зла». Есть мы - люди с разными опытами. Как прийти к общности и солидарности? Я хз, честно. Могу только предположить, что отказ от слов «они - мы», осознание своих привилегий и слышать что говорят люди, вполне может возродить новую волну перемен. И, пожалуйста, всегда помните, что если вы хотите быть «спасателем», то потом будете либо «жертвой», либо «агрессором» и так по кругу треугольника. 

Есть система, которая маркирует нас как девочек и мальчиков, выдает в подарок розовую или голубую ленточку и формирует нашу жизнь. Подарок судьбы - набор гендерных ролей, социальных ожиданий. Система говорит, кого нужно любить - только людей отличного от нас пола приписанного при рождении и какими мы должны быть во всей этой любви и жизни. Она же диктует и управляет нашими эмоциями, чувствами, здоровьем. А также втягивает нас в постоянную работу до потери пульса. 

Я могу продолжать долго, но суть ясна. Вездесущее зло - не ЛГБТ+ люди или «главная проблеме» о которой говорят с трибун, а система, которой выгодно поддерживать свои паттерны и выдавать их за истинность, правильность и традиционность. 

Жизнь, которую мы живем, - неоднозначная и многое, если не все, фрактально. Идеальной жизни не существует, но и ее отсутствие не говорит о том, что не нужно пытаться сделать жизнь более комфортнее. Мир меняется - мы живем во время Covid-19, который знатно ударил по всем нам, теория критикуется, разные страны проживают свои политические изменения, соорганизуются мировые волны солидарности разных сообществ, усиливаются голоса людей. Эти изменения происходят, и мы можем быть сопричастны, потому что в каждых из нас живет своя утопия.

ЛГБТ-активистки, феминистки`,
        },
        {
          name: 'Диана',
          video: require('@/assets/videos/outro/diana.mp4'),
          text: `С самого детства мне навязывали, что ЛГБТ-люди - это «больной мир»! Что это те, от которых стоит бежать, ведь они могут сделать тебя подобной себе. Сейчас я не ребенок, но во взрослом мире навязывания не меньше. И это касается не только темы ЛГБТ. И каким бы ты ни был свободным, окружение формирует тебя. 

В какие-то моменты ловишь себя на том, что боишься этого! Понимаешь, что странно оглядываешься на прохожего, который может быть чуть нетипичнее остальных. Будто в голове есть общая картинка людей, а если что-то выбивается, ты вдруг теряешься. 

В своей журналистской работе я знакомлюсь с людьми, которых всегда считаю уникальными. Но в начале этого проекта с определением «уникальные люди» в глубине моей души находилось и определение «другие». Наверное, это и есть шлейф оптики общества! 

Я все больше понимаю, что мы все можем быть какими угодно! При этом между нами больше общего, чем нам кажется, чем мы думаем, видим и ощущаем. Все мы одинаково видим картину «правды», «истины», «обмана». У нас одни и те же методы выживания, защиты и преодоления трудностей. И наше незнание формируем мы сами, общество, страх. 
`,
        },
      ],
    }
  },
}
</script>

<style lang="scss" scoped>
</style>